const MongoClient = require("mongodb").MongoClient;
const url = "mongodb://localhost:27017/dirtypolitics";
var post = { name: "Politics is always Dirty",
              description: "<span style='display:inline-block; width:50px;'></span>రాజకీయాల్లో నీతికోసం వెతకడం,   నేతీబీరకాయలో నేతికోసం  వెదకడం రెండూ ఒక్కటే.  అందరూ విలువల కోసం  వెతుకుతుంటారు కానీ,  విలువలు దేవాతావస్త్రాల్లాంటివి. అవి కనబడవు. కనపడినట్టు నటిస్తూ వుంటారు.<br></br>రాజకీయమంటే  ఏమిటి ? ఒక సమూహంపై  పెత్తనం చేయడం, ఆ  సమూహంతో  సేవచేయించుకోవడం, ఎంతో కొంత సమూహాన్ని రక్షించడం.",
              content : "<br><span style='display:inline-block; width:50px;'></span>డార్విన్  సిద్ధాంతం ప్రకారం మనిషి జంతువు నుంచి పుట్టాడు. జంతువులని మీరు గమనించండి. అక్కడ కూడా బలమైన జంతువు మిగతా వాటిని అదుపులో ఉంచుతుంది. పది కోతులుంటే ఒక కోతి ఆజ్ఞలిస్తూ ఉంటుంది. దాన్ని ఇంకో కోతి ధిక్కరిస్తుంటుంది. రెండింటి 'మధ్య ఘర్షణ. ఒకటి గెలుస్తుంది. నాయకుడవుతుంది. మన సందులో ఉన్న కుక్కల గుంపును చుడండి. (హైదరాబాదులో ఎన్ని వేల కుక్కలున్నయో నైట్ డ్యూటీ చేసి ఇంటికొచ్చేవారికి కరెక్టుగా తెలుస్తుంది) ఒక 'కుక్క నాయకుడిగా ఉండి కమాండ్ చేస్తూ ఉంటుంది. చైనాకి మనకి సరిహద్దుల లెక్క తెలియక గందరగోళం ఉండొచ్చుకాని, కుక్కలు మనకంటే జ్ఞానంతో ఉంటాయి. లైన్ అఫ్ కంట్రోల్ విషయంలో చాల'కఠినంగా ఉంటాయి. బోర్డర్ దాటనే దాటవు. దాటితే పెద్ద యుద్ధమే. అప్పుడప్పుడు మన బండ్లకు అడ్డుపడే కుక్కల వీధిపోరాటం, ఆషామాషీ పోరాటం కాదు. దాని వెనక సరిహద్దు సంరక్షణ యుద్ధం ఉండచ్చు.'</br>'<br>'<span style='display:inline-block; width:50px;'></span>తేనెటీగల్లో రాణి ఈగ వున్నట్లే, దోమల్లో కూడా రాణిదోమ ఉంటుంది. మనకు తెలిసిందే జ్ఞానం వాస్తవం కాదు. ఈ భూమ్మీద బతకాలంటే ఒక వ్యవస్థకు లోబడి ఉండాలి. ఆ వ్యవస్థ ఎప్పుడు బలవంతుడి చేతిలో ఉంటుంది. ఒకవేళ ఎప్పుడైనా బలహీనులు ఒక గుంపుగా ఏర్పాడి బలవంతుడి రాజ్యాన్ని కూలగొట్టినా, అధికారంలోకి వచ్చిన మరుక్షణం, ఆ బలహీనులు బలవంతులుగా మారిపోతారు. ఆ బలవంతుల్లో ఎవడు అతిపెద్ద బలవంతుడనే విషయం పై యుద్ధం జరుగుతుంది. అమావాస్య ఉంటేనే పున్నమి. యుద్ధం వుంటేనే శాంతి.'</br> '<br>'<span style='display:inline-block; width:50px;'></span>ఎవడోఒకడు తంతాడనే భయం లేకపోతే మనం ప్రశాంతంగా జీవించలేము. తన్నే వ్యవస్థని మనం ఎంత నిరసించిన ఆ వ్యవస్థ మనకు అవసరం. పోలీసులంటే ఎంత కోపమున్న, మనింట్లో దొంగలు పడితే స్టేషన్ కే వెళతాం తప్ప, దొంగల్లో మార్పుతేవడానికి పాటలు పాడుకుంటూ రోడ్లెంబడి తిరగం. ఒకవేళ మావోయిస్టులు అధికారంలోకి వచ్చిన వాళ్ళుకూడా  ఈ పోలీసులు, ఈ ఆర్మీతోనే  రాజ్యం చేయించాల్సిందే తప్ప, వాళ్లకు కొత్త పోలీసులు, కొత్త సైనికులు వుండరు.'మనిషి పుట్టినప్పటి నుంచి ఏ చరిత్ర తీసుకున్నా రాజకీయమంటే బలవంతులు వేదిక. దురాశ, కుట్ర, వెన్నుపోటు, లౌక్యం, మంచితనపు ముసుగు, ధర్మాపన్నాలు, ఇవన్నీ కలిస్తేనే రాజకీయం.</br>'<br>'<span style='display:inline-block; width:50px;'></span>ఆధ్యాత్మిక వాదులు ప్రకారం మనిషిని దేవుడే పుట్టించాడని అనుకుంటే ఆ దేవుడే పెద్ద పొలిటీషియన్. శ్రీ కృష్ణున్ని మించిన రాజకీయనాయకుడు ఇంకా పుట్టలేదు.</br>'<br>'  <span style='display:inline-block; width:50px;'></span>       గతం నుంచే వర్తమానం, వర్తమానం నుంచే భవిష్యత్తు పుడతాయి, ఈ క్షణంలో వర్తమానం, మరుక్షణానికి గతమవుతుంది. గతం నుంచి ఎవరూ పాఠాలు నేర్చుకొరు. నాదేండ్ల తిరుగుబాటు నుంచి ఏమి నేర్చుకోకపోవడం వల్లనే ఎన్టీఆర్ రెండోసారి వెన్నుపోటుకు గురయ్యారు.</br>'<br>' <span style='display:inline-block; width:50px;'></span>        రాజకీయాల్లో నైతికవిలువలనే మాట పాక్షిక సత్యం. అశ్వద్దామా హతః అని పైకి అనుకుంటూ  మనసులో కుంజరః అనుకోవడమే రాజకీయం. అధికారంలో ఉన్నప్పుడు వాళ్ళు చేసిందే నీతి. అధికారంలో లేనప్పుడు అంతా అవినీతే.</br>'<br>' <span style='display:inline-block; width:50px;'></span>      ఇదంతా ఒక ఆట. మనం ప్రేక్షకులం. చంద్రబాబు అమరావతిని గ్రాఫిక్స్ లో కడుతూ ఉంటే మనం చప్పట్లు కొడుతూ ఉంటాం. లాలూ లోని అవినీతిని నితీష్ కొత్తగా కనిపెట్టాడని సంతోషిస్తూ ఉంటాం. మోడీ ఈ దేశాన్ని స్వచ్ఛభారత్ చేస్తాడని ఆశపడుతూ ఉంటాం. ఎవరో నటుడు డ్రగ్స్ తీసుకున్నాడని తెలిస్తే పగలు రాత్రి టీవీ వార్తలు చూస్తూ ఉంటాం. రైతులు పొలాల్లోనే ఆత్మహత్యలు చేస్కుంటూ ఉంటే ఛానళ్ళు మార్చేస్తాం. మనం ఎలా ఉన్నా పరవాలేదు. మన నాయకులు నీతి నియమాలతో ఉండాలని కోరుకుంటాం. మనం మన నాయకులు ఒకే నాణేనికి బొమ్మాబొరుసులనే విషయం మర్చిపోతాం.</br>",
              image : "images/firstarticle.jpg",
              active : 1,
              author : "-జి.ఆర్ మహర్షి ",
              date: "2017-07-29 00:05:19",
              ip :"",
              views:[{ip:"106.201.105.82",date:"2017-07-30 14:52:54"}],
              comments:[{user:"Manoj",email:"hvmanojk@gmail.com",comment:"Hey There Dirty politics",ip:"106.201.105.82",date:"2017-07-30 14:52:54"}] };
MongoClient.connect(url,(err,db)=>{
  if(err) throw err;

  db.collection("posts").insertOne(post,(err,res)=>{
    if(err) throw err;

    console.log("Document Inserted");
    db.close();
  });


});
